import { h } from 'preact';

export default function Requirements(): h.JSX.Element {
    return (
        <section className="Requirements">
            <div className="block">
                <header className="block__header">Вимоги до підготовки фотоматеріалів</header>

                <h2>Загальні вимоги до фотографій</h2>

                <ol>
                    <li>
                        Цифрові фотографії повинні бути чіткими, важлива яскравість, контрастність і кольоровість. Для
                        чорно-білих фотографій в зоні обличчя має бути мінімум 64 градації сірого, в іншому разі можливе
                        зниження якості розпізнавання.
                    </li>
                    <li>
                        Рекомендовано використовувати цифрові фотографії без проміжної обробки або з мінімально
                        необхідною додатковою обробкою (наприклад, проста обрізка фотографії без додаткової компресії і
                        інших перетворень з допомогою фоторедакторів/конвертерів форматів).
                    </li>
                    <li>Рекомендована максимальна роздільна здатність фотографій – не більше 1920х1080.</li>
                    <li>
                        Мінімальна роздільна здатність зони обличчя фотографії рекомендована – не менше 320х240, якщо
                        роздільна здатність нижча, можлива низька якість розпізнавання.
                    </li>
                    <li>
                        Бажаний розмір голови в кадрі – 70% по горизонталі, при умові дотримання рекомендованої
                        мінімальної роздільної здатності зони обличчя.
                    </li>
                    <li>
                        Відсутність будь-якої обробки (відсутність додаткової обробки конвертерами/компресорами або
                        фоторедакторами типу Photoshop). При використанні фотографій з додатковою обробкою можливе
                        зниження якості розпізнавання.
                    </li>
                    <li>
                        Не рекомендовано використання з метою розпізнавання фотографії обличчя з закритими очима,
                        відкритим ротом, мімікою, що спотворює нормальний вираз обличчя, яскравим макіяжем, волоссям або
                        головними уборами, що відкидають тіні на обличчя, в іншому разі можлива низька якість
                        розпізнавання.
                    </li>
                    <li>
                        Використання обличчя з надітими темними сонячними окулярами (а також будь-якими іншими
                        предметами одежі і масок, що закривають частину обличчя) для розпізнавання є неприпустимими.
                    </li>
                    <li>
                        Зона обличчя визначається, як частина зображення людини на фотографії від маківки до підборіддя,
                        від лівого вуха до правого вуха.
                    </li>
                </ol>

                <h2>Загальні вимоги до сканованих фотографій</h2>

                <ol>
                    <li>
                        Для сканування рекомендовано використовувати оригінали на цупкій копії належної якості,
                        контрастності і кольоровості, що не підлягали додатковій обробці (ретушування, фоторедактори
                        тощо). В іншому разі можливе зниження якості розпізнавання.
                    </li>
                    <li>
                        Під час використання сканованої фотографії обличчя з документів рекомендована максимальна
                        роздільна здатність сканованих фотографій – не більше 1920х1080 (достатньо роздільної здатності
                        сканера 300 dpi, мінімальної цифрової роздільної здатності зони обличчя – 640х480).
                    </li>
                    <li>
                        Допускається (але не рекомендовано) сканування чи фотографування обличчя з цупких оригіналів
                        документів за допомогою смартфонів, планшетів або цифрових фотоапаратів з мінімальною роздільною
                        здатністю зони обличчя 640х480, за відсутності відблисків і просторових спотворень. При цьому
                        можливе зниження якості розпізнавання.
                    </li>
                </ol>

                <h2>Додаткові вимоги до групових фотографій</h2>

                <ol>
                    <li>
                        На групових фотографіях обличчя не повинні перекривати одне одного, в іншому разі частина обличь
                        може бути не оброблена.
                    </li>
                    <li>
                        Площа окремого обличчя на фотографії повинна складати не менше 5% від загальної площі фотографії
                        за умови дотримання вимог до мінімальної роздільної здатності зони обличчя (не менше 320х240),
                        інакше можливе пропускання обличчя при захопленні зображення і низька якість розпізнавання.
                    </li>
                    <li>
                        Під час використання групових фотографій рекомендовано окремо вирізати зону/зони облич і без
                        додаткових перетворень відправляти на розпізнавання.
                    </li>
                    <li>
                        При наявності великої кількості облич на груповій фотографії (більше 5-10) рекомендовано
                        розділяти (з мінімально необхідним дублюванням зони обличчя) такі фотографії на декілька
                        фрагментів і направляти в систему для окремого розпізнавання.
                    </li>
                </ol>

                <h2>Додаткові вимоги до фотографій при порівнянні 1:1</h2>

                <ol>
                    <li>
                        Для порівняння облич в режимі 1:1 рекомендовано використовувати цифрові фотографії з вимогами і
                        якістю, як для документів (паспорт, ID-картка, водійське посвідчення, перепустка тощо).
                    </li>
                    <li>
                        Рекомендований ракурс обличчя при порівнянні 1:1 – фронтальне зображення (анфас), ідеальні
                        вимоги до фотографій обличчя викладені в стандарті ISO 19794-5.
                    </li>
                    <li>
                        Під час використання інших ракурсів облич (не фронтальних), для розпізнавання в режимі 1:1
                        рекомендовано використовувати фотографії з однаковим нахилом і поворотом голови, в іншому разі
                        можливе зниження якості розпізнавання.
                    </li>
                    <li>
                        Використання ракурсу обличчя з горизонтальним/вертикальним відхиленням більше + 15% від
                        фронтального положення не рекомендовано, в іншому разі можливе зниження якості розпізнавання.
                    </li>
                    <li>
                        Під час застосування режиму порівняння 1:1 допускається використання сканованих
                        (сфотографованих) облич з документів на цупких копіях, при цьому можливе зниження якості
                        розпізнавання.
                    </li>
                </ol>

                <h2>Допустимі методи додаткової обробки фотографій</h2>

                <ol>
                    <li>
                        Для отримання необхідного для розпізнавання типу зображення обличчя з вихідного зображення не
                        допускається застосування методів постобробки, за виключенням повороту в площині, кодування
                        (вирізання без перетворень), зменшення роздільної здатності або стиснення без суттєвої втрати
                        якості.
                    </li>
                    <li>Не припустиме використання багаторазового (тобто повторюваного) стиснення.</li>
                    <li>Не допускається використання геометричних викривлень обличчя.</li>
                    <li>
                        Не допускається використання методів постобробки, що маскують або спотворюють природні відмінні
                        риси обличчя.
                    </li>
                </ol>
            </div>
        </section>
    );
}
